txbr/txbr/webservice/txbr.statOFFTxbr.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:txbr="http://tempuri.org/txbr.xsd">
 <SOAP-ENV:Body>
  <txbr:statOFFTxbr>
   <workDirectory></workDirectory>
  </txbr:statOFFTxbr>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
